index.html
---
layout: page
title: "About"
---

{% include image.html url="/bin/carlhenrikkth.png" width=300 align="left"%}

<p>
My name is <b>Carl Henrik Ek</b> and I am a Senior Lecturer in Computer Science at the University of Bristol, UK and a Docent in Machine Learning at the Royal Institute of Technology, Sweden.
</p>

<p>
Learning is the task of associating a new phenomena to previous knowledge. Knowledge is the capability of providing structure to the environment. In the field of machine learning we try to build methods that are capable of learning directly from data. The fundamental aspect of learning is assumptions, being the realisation of knowledge, the science of machine learning is concerned with how to formulate assumptions into mathematical models (modelling) and how to related them to observed data (inference). My research focus spans both these areas, in specific I am interested in how we can specify data efficient and interpretable assumptions that allows us to learn from small amounts of data. Most of my work is focused on Bayesian non-parametric methods and in specific Gaussian processes.
</p>

<p>
<b>Short Bio</b>
Before joining Bristol I was an Assistant Professor in Machine Learning at the Royal Institute of Technology (KTH) in Stockholm. I did my postdoctoral research at University of California at Berkeley. My PhD is from Oxford Brookes University. I spent two years of my PhD at the University of Manchester where I was a research assistant in the Machine Learning and Optimisation group and a further six months at University of Sheffield as a visitor in the Machine Learning group. My supervisors during my PhD where Professor Neil Lawrence and Professor Phil Torr and for my post-doc Professor Trevor Darrell. Prior to this I was at University of Bristol where I was working together with Dr. Neill Campbell on Computer Vision in specific related to natural image statistics. My undergraduate degree was an MEng degree in Vehicle Engineering from KTH in Stockholm.
</p>

<div id="outline-container-org90d14bc" class="outline-2">
<h2 id="org90d14bc">News</h2>
<div class="outline-text-2" id="text-org90d14bc">
<dl class="org-dl">
<dt>2017/11</dt><dd>Gave a tutorial titled <i>Bayesian Non-parametrics and Priors over Functions</i> at Imperial College London.</dd>
<dt>2017/10</dt><dd>Gave a lecture on <i>Intelligent Machines</i> for <a href="https://www.unionen.se/">Unionen</a> a Swedish union for private companies</dd>
<dt>2017/09</dt><dd>Gave a lecture on <i>Unsupervised Learning using Gaussian Processes</i> at the <a href="http://gpss.cc/gpss17/">Gaussian Process and Uncertainty Quantification Summer School</a> The video of the talk can be found <a href="https://youtu.be/XZOUMRlmL_Y?list=PLpTp0l_CVmgwyAthrUmmdIFiunV1VvicM">here</a></dd>
<dt>2017/08</dt><dd>Gave 3 lectures on Machine Learning at the <a href="https://courses.cs.ut.ee/t/esscass2017/Main/CFP">Estonian Summer School on Computer and Systems Science</a> titled <i>Assumptions</i>, <i>Models</i> and <i>Inference</i>.</dd>
<dt>2017/06</dt><dd>Gave a 1 day course on machine learning for developers for Peltarion in Stockholm</dd>
<dt>2017/05</dt><dd>Gave seminar on AI for <a href="http://www.wiseit.se/">WiseIT</a> in Stockholm</dd>
<dt>2017/04</dt><dd>Gave a seminar for <a href="http://partsradet.se/om-2/representantskap/ai-ar-inte-magi/">Partsrådet</a> titled <i>Digitalisation, Learning and the value of information</i></dd>
<dt>2016/10</dt><dd>Awarded Teacher of the year in Computer Science at University of Bristol</dd>
<dt>2016/09</dt><dd>Gave open lecture on <i>Artificial Intelligence and the Future of Employment</i></dd>
<dt>2016/03</dt><dd>Gave a workshop on <i>Thinking Machines in a Digital World</i> for <a href="http://partsradet.se/arbetsomraden/tidigare/forandring-och-utveckling/utvecklingsprogram/start-for-2016-ars-utvecklingsprogram/">Partsrådet</a></dd>
<dt>2016/06</dt><dd>Organising <a href="http://iv2016.berkeleyvision.org/">Workshop on Learning Representations at Intelligent Vehicles</a> in Gothenburg with Trevor Darrell and Erik Rodner. I am also a Associate Workshop Editor for the conference.</dd>
<dt>2016/04</dt><dd>New paper titled Multi-view Learning as a Nonparametric Nonlinear Inter-Battery Factor Analysis available on <a href="http://arxiv.org/abs/1604.04939">arXiv</a></dd>
<dt>2016/02</dt><dd>Awarded the degree of Docent in Machine Learning at Royal Institute of Technology, KTH, Stockholm, Sweden</dd>
<dt>2016/01</dt><dd>Acted as opponent for Ekaterina Kolycheva defending her thesis <i>Grasp planning under uncertainty</i>.</dd>
<dt>2015/12</dt><dd>I gave a <a href="https://www.ted.com/tedx/events/17751">TEDx</a> talk titled “Why I do not fear Artificial Intelligence” you can find the Video of the talk <a href="https://www.youtube.com/watch?v=g2FiOz9FlTc&amp;list=PLsRNoUx8w3rNPudaJgiY_3OSFDVy79MU7">here</a>.</dd>
<dt>2015/12</dt><dd>Interview (in Swedish) for Campi magazine <a href="https://campi.kth.se/nyheter/med-bergfast-tilltro-till-studenterna-1.613960">URL</a></dd>
<dt>2015/11</dt><dd>Awarded Teacher of the year at Royal Institute of Technology, Sweden <a href="bin/2015_TeacherOfTheYear.pdf">motivation</a></dd>
<dt>2015/10</dt><dd>Awarder Teacher of the year from Student chapter in Industrial Economics at Royal Institute of Technology</dd>
<dt>2013/10</dt><dd>Interview (in Swedish) about teaching in national Swedish student magazine Shortcut <a href="http://shortcut.se/artiklar/man-lar-sig-nar-man-har-roligt/">URL</a></dd>
<dt>2012/06</dt><dd>Awarded Teacher of the year in Computer Science at Royal Institute of Technology</dd>
</dl>
</div>
</div>
